%
O0096
G21 G18 G40 G49 G80
G92 X0 Y0 Z0
G01 X0 Y0 Z0 F100.	    
G91 G41 G01 Z100. X100. K1 D1       ; G41指定KI矢量(起刀)
G01 Z40. F1000		
G01 Z10. X40. K1                    ;    G41指定KI矢量(偏置)
Z0.   K10 I-10                     ;    G40 KI矢量段 前指定 G41段KI矢量(无移动)
G40 Z0. K-10                       ;    G40 KI矢量段 （无移动）
X-50.
G41 G01 Z10. D1
Z10. X40. K1 I1                       ;    
Z0.                                 ;    （2） G41段(无移动)
G40 Z0. K-10                     ;    G40 KI矢量段 （无移动）、
X-50.
G41 G01 Z10. D1
Z10. X40. K1 I1                       ;    
Z0.                                 ;     （3）G41段(无移动)
G40  Z0                      ;    G40  （无移动）
Z10
X-50.
G41 G01 Z10. D1
Z10. X40. K1 I1                       ;    
Z0.                                 ;     （4）G41段(无移动)
G40 Z10.  K-10                       ;    G40 KI矢量段 （有移动）
Z10 X-50.
G41 G01 Z10. D1
Z10. X40. K1 I1                     ;    
Z0.                                 ;     （5）G41段(无移动)
G40 Z10.                       ;    G40 KI矢量段 （有移动）
Z10. X-50.
G41 G01 Z10. D1
Z10. X40. K1 I1                     ;    
Z10.                                 ;     （6）G41段(移动)
G40 Z10 X-10. 
Z10. X-50.
G41 G01 Z10. D1
Z10. X40.
Z0. K1                        ;     （7）G41段(KIK 无移动)
Z10. X-40.
G40 Z10.
Z10. X-50.
G91 G41 G01 Z0. K1 D1                  ; (8)G41指定KI矢量(起刀无移动)
G01 Z40.  
G01 Z10. X40. K1                    ;    G41指定KI矢量(偏置)
Z0.  K30 I-10                       ;    G40 KI矢量段 前指定 G41段KI矢量(无移动)
G40 G01  Z20. X20. K10 I-10
Z10. X-50.
G91 G41 G01 Z0. K1 D1                  ; (9)G41指定KI矢量(起刀无移动)
G01 Z40. X40.
G01 Z0 K10 I10                      ;  空移动指定 KIK 	
G01 Z10. X-40. K1                 ; G41指定KI矢量(偏置)
Z20.  K30 I-10                   ; G40 KI矢量段 前指定 G41段KI矢量
G40 G01  Z20. X20. I-10 
%