%
O0096
G21 G17 G40 G49 G80
G92 X0 Y0 Z0
G01 X0 Y0 Z0 F100.	    
G91 G41 G01 X100. Y100. I1 D1       ; G41指定IJ矢量(起刀)
G01 x40. F1000		
G01 X10. Y40. I1                    ;    G41指定IJ矢量(偏置)
x0.   I10 j-10                     ;    G40 IJ矢量段 前指定 G41段IJ矢量(无移动)
G40 X0. I-10                       ;    G40 IJ矢量段 （无移动）
Y-50.
G41 G01 X10. D1
X10. Y40. I1 J1                       ;    
x0.                                 ;    （2） G41段(无移动)
G40 X0. I-10                     ;    G40 IJ矢量段 （无移动）、
Y-50.
G41 G01 X10. D1
X10. Y40. I1 J1                       ;    
x0.                                 ;     （3）G41段(无移动)
G40  X0                      ;    G40  （无移动）
X10
Y-50.
G41 G01 X10. D1
X10. Y40. I1 J1                       ;    
x0.                                 ;     （4）G41段(无移动)
G40 X10.  I-10                       ;    G40 IJ矢量段 （有移动）
X10 Y-50.
G41 G01 X10. D1
X10. Y40. I1 J1                     ;    
x0.                                 ;     （5）G41段(无移动)
G40 X10.                       ;    G40 IJ矢量段 （有移动）
X10. Y-50.
G41 G01 X10. D1
X10. Y40. I1 J1                     ;    
x10.                                 ;     （6）G41段(移动)
G40 X10 Y-10. 
X10. Y-50.
G41 G01 X10. D1
X10. Y40.
X0. I1                        ;     （7）G41段(IJK 无移动)
X10. y-40.
G40 X10.
X10. Y-50.
G91 G41 G01 X0. I1 D1                  ; (8)G41指定IJ矢量(起刀无移动)
G01 x40.  
G01 X10. Y40. I1                    ;    G41指定IJ矢量(偏置)
x0.  I30 J-10                       ;    G40 IJ矢量段 前指定 G41段IJ矢量(无移动)
G40 G01  X20. Y20. I10 J-10
X10. Y-50.
G91 G41 G01 X0. I1 D1                  ; (9)G41指定IJ矢量(起刀无移动)
G01 x40. Y40.
G01 X0 I10 J10                      ;  空移动指定 IJK 	
G01 X10. Y-40. I1                 ; G41指定IJ矢量(偏置)
x20.  I30 J-10                   ; G40 IJ矢量段 前指定 G41段IJ矢量
G40 G01  X20. Y20. J-10 
%